code-review/NRB_3471_3546/База_Было/Reports/СверкаОстатковЦБПоРазделамСВыписками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СверкаОстатковЦБПоРазделамСВыписками</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникВыписок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыписок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлВыписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакРазделаБлокировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакСекцииРаздела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакНомераРаздела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакISIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакКоличества</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакРасширенияФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеПоОстаткам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодРаздела</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ISIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Блокировано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФайлыВыписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВФайле</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВИмени</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Reports/СверкаОстатковЦБПоРазделамСВыписками/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаСервере
Перем мТекущийОбъектНаСервере; // Реквизит формы "Отчет", преобразованный в объект прикладного типа

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ТекущийОбъект());
	
	ИнициализироватьНаСервере("РДЦ");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КлючУникальности = Новый УникальныйИдентификатор;
	
	ИнициализироватьНаКлиенте(Отчет.ИсточникВыписок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СохранитьНастройкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФайлВыпискиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РасширениеФайла = Отчет.ПризнакРасширенияФайла;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.ПолноеИмяФайла = Отчет.ФайлВыписки;
	Диалог.Заголовок = "Выберите файл выписки " + Отчет.ИсточникВыписок;
	Диалог.Фильтр = "*." + РасширениеФайла + "|*." + РасширениеФайла;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.ПредварительныйПросмотр = Ложь;
	
	ВозвращаемоеЗначение = Диалог.Выбрать();
	Если ВозвращаемоеЗначение Тогда
		Отчет.ФайлВыписки = Диалог.ПолноеИмяФайла;
		ПолучитьОстаткиИзВыпискиНаКлиенте(Отчет.ФайлВыписки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог с выписками " + Отчет.ИсточникВыписок;
	Диалог.Каталог = Отчет.КаталогВыписок;
	Диалог.ПредварительныйПросмотр = Ложь;
	
	ВозвращаемоеЗначение = Диалог.Выбрать();
	Если ВозвращаемоеЗначение Тогда
		Отчет.КаталогВыписок = РаботаСФайлами.ПолучитьАбсолютныйПуть(Диалог.Каталог);
		СохранитьНастройкиНаСервере();
	КонецЕсли;
	
	ПолучитьФайлыВыпискиНаСервере(Отчет.КаталогВыписок, Отчет.ИсточникВыписок);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьФайлыВыпискиНаСервере(КаталогВыписок, ИмяИсточникаВыписки)
	
	Если ЗначениеЗаполнено(КаталогВыписок) Тогда
		
		ТекущийОбъект().ПолучитьФайлыВыписки(КаталогВыписок, ИмяИсточникаВыписки);
		
		ЗначениеВРеквизитФормы(ТекущийОбъект(), "Отчет");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникВыписокПриИзменении(Элемент)
	
	ИнициализироватьНаСервере(Отчет.ИсточникВыписок);
	
	ИнициализироватьНаКлиенте(Отчет.ИсточникВыписок);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлыВыписок

&НаКлиенте
Процедура ФайлыВыписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Отчет.ФайлВыписки = Отчет.ФайлыВыписок.НайтиПоИдентификатору(ВыбраннаяСтрока).ИмяФайла;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЧтенияДанныхВыписки;
	
	ПолучитьОстаткиИзВыпискиНаКлиенте(Отчет.ФайлВыписки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПолучитьОстаткиИзВыпискиНаСервере(Адрес, ИмяИсточникаВыписки)
	
	Результат.Очистить();
	
	ТекущийОбъект().ПолучитьОстаткиИзВыписки(Адрес, ИмяИсточникаВыписки);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект(), "Отчет");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОстаткиИзВыписки(Команда)
	
	ПолучитьОстаткиИзВыпискиНаКлиенте(Отчет.ФайлВыписки);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЧтенияВыпискиПоУмолчанию(Команда)
	
	ИнициализацияПоУмолчаниюНаСервере(Отчет.ИсточникВыписок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьКаталогВыписок(Команда)
	
	ПолучитьФайлыВыпискиНаСервере(Отчет.КаталогВыписок, Отчет.ИсточникВыписок);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьНаСервере(ИмяИсточникаВыписки)
	
	ИнициализацияПоУмолчаниюНаСервере(ИмяИсточникаВыписки);
	
	Отчет.ФайлВыписки = "";
	Отчет.ДанныеПоОстаткам.Очистить();
	Результат.Очистить();
	ПараметрПериод = ФункцииОтчетовКлиентСервер.ПолучитьПараметр(Отчет.КомпоновщикНастроек, "Период");
	ПараметрПериод.Значение = Дата(1, 1, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьНаКлиенте(ИмяИсточникаВыписки)
	
	Заголовок = ИмяОтчета() + " [" + ИмяИсточникаВыписки + "]";
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПоискВыписок;
	
	ВосстановитьНастройкиНаСервере();
	ПолучитьФайлыВыпискиНаСервере(Отчет.КаталогВыписок, ИмяИсточникаВыписки);
	
КонецПроцедуры

&НаСервере
Функция ИмяОтчета()
	
	Возврат "Отчет." + ТекущийОбъект().Метаданные().Имя;
	
КонецФункции

&НаСервере
Функция ТекущийОбъект()
	
	Если мТекущийОбъектНаСервере = Неопределено Тогда
		мТекущийОбъектНаСервере = РеквизитФормыВЗначение("Отчет");
	КонецЕсли;
	
	Возврат мТекущийОбъектНаСервере;
	
КонецФункции

&НаСервере
Процедура ИнициализацияПоУмолчаниюНаСервере(ИмяИсточникаВыписки)
	
	ИмяОтчета = ИмяОтчета();
	
	ТекущийОбъект().ИнициализацияПоУмолчанию(ИмяОтчета, ИмяИсточникаВыписки);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект(), "Отчет");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	ИмяОтчета = ИмяОтчета();
	
	ТекущийОбъект().СохранитьНастройки(ИмяОтчета, Отчет.ИсточникВыписок);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиНаСервере()
	
	ИмяОтчета = ИмяОтчета();
	
	ТекущийОбъект().ВосстановитьНастройки(ИмяОтчета, Отчет.ИсточникВыписок);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект(), "Отчет");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОстаткиИзВыпискиНаКлиенте(ИмяФайлаВыписки)
	
	ФайлВыписки = РаботаСФайлами.ПолучитьАбсолютныйПуть(ИмяФайлаВыписки);
	
	Если Не ОбщегоНазначенияКлиентСервер.ФайлСуществует(ФайлВыписки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл: [ " + ФайлВыписки + " ] не существует!");
		Возврат;
	КонецЕсли;
	
	Попытка
		Файл = Новый ДвоичныеДанные(ФайлВыписки);
		Адрес = ПоместитьВоВременноеХранилище(Файл, УникальныйИдентификатор);
		ПолучитьОстаткиИзВыпискиНаСервере(Адрес, Отчет.ИсточникВыписок);
	Исключение
		МенеджерОшибок = Новый МенеджерОбработкиОшибок;
		ТекстСообщения = МенеджерОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не могу прочитать файл. Произошла ошибка!: " + ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
